Revit 2017 API
Wire.ConnectTo Method
 Connects the wire to other elements.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public void ConnectTo(
	Connector startConnectorTo,
	Connector endConnectorTo
)
Visual Basic
Public Sub ConnectTo ( _
	startConnectorTo As Connector, _
	endConnectorTo As Connector _
)
Visual C++
public:
void ConnectTo(
	Connector^ startConnectorTo,
	Connector^ endConnectorTo
)
Parameters
startConnectorTo
Type: Autodesk.Revit.DB.Connector
 The connector that the start connector of the wire connects to.
endConnectorTo
Type: Autodesk.Revit.DB.Connector
 The connector that the end connector of the wire connects to.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  startConnectorTo cannot be connected to a wire, as it is not an electrical connector. -or- endConnectorTo cannot be connected to a wire, as it is not an electrical connector.
Autodesk.Revit.Exceptions.InvalidOperationException |  Cannot connect the wire to the start connector or the end connector.
See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace